from math import pi
# Задание 1
# second = float(input("секунд від початку дня: "))
# midnight = input("что посчитать (second, m, h) = ")

# if midnight == "s":
#     print(86400 - second)
# elif midnight == "m":
#     print(1440 - (second / 60))
# elif midnight == "h":
#     print(24 - ((second / 60) / 60))
# else:
#     print("ты что делаешь?")

# Задание 2

# circle = float(input("Введіть довжину кола: "))

# print(pi * ((circle / 2) * (circle / 2)))

# Задание 3    

# console_price = float(input("Введіть ціну консолі: "))
# discount = float(input("Введіть відсоток знижки: "))
# deal =  int(input("Введіть суму яку ви маєте: "))
# final_price = (console_price / 100) * deal
# discounted_price = console_price - ((console_price / 100) * discount)

# print(f"Консоль зі знижкою коштує: {discounted_price}")

# Задание 4
bit = float(input("Введіть кількість біт: "))
gigabyte = float(input("Введіть кількість гігабайт: "))
time = input(" ")